{
    "all_objs": [
        "Collaborate to place blocks according to the blueprint `minecraft/templates/nether_fossils_fossil_3`.\r\n - Use the materials from the chest at[-4, 0, 5]. The other chest in the factory with tools is not needed for this task.\r\n",
        "Work together to catch at least 10 fish (a mix of cod and salmon) using the fishing rods and bait from the chest.  \r\n- Ensure the caught fish are stored in a second chest placed at [10, 0, 20].",
        "Cooperate to smelt 20 iron ingots using the furnace located at [5, 0, 12].  \n- Retrieve the necessary iron ore from the chest at [5, 0, 10] and fuel (coal) from the chest at [5, 0, 8].  \n- Store the smelted iron ingots in the chest at [5, 0, 14].",
        "Collaborate to construct a small village well using the materials from the chest at [10, 0, 15]. The well should be 3 blocks deep and 2 blocks wide, with a oak_planks placed inside for decoration.  \n- Gather water from the nearby lake at [8, 0, 20] using empty buckets, then assembles the well structure using the cobblestone and wooden planks provided.  \n- Ensure all unused materials are returned to the chest upon completion.",
        "Cooperate to build barricades and equip weapons.  \n- Use the wood and stone materials from the chest at [5, 0, 15] to construct barriers around the village perimeter.  \n- Equip swords and bows from the armory chest at [7, 0, 18] and distribute them among the agents.  \n- Ensure all villagers are safely inside their houses by interacting with doors to close them. ",
        "Collaborate to build a small animal pen near the village at [8, 0, 15].  \n- Gather materials (wooden planks and fences) from the chest at [7, 0, 14] and construct the pen.  \n- Lead at least 3 sheep and 2 cows into the pen using wheat from the chest.  \n- Ensure the animals are safely enclosed and fed before sunset.",
        "Collaborate to bake 30 loaves of bread using the furnace located at [8, 0, 10].  \n- Harvest wheat from the nearby farm at [8, 0, 15] and collect the necessary fuel (charcoal) from the chest at [8, 0, 8].  \n- Store the baked bread in the chest at [8, 0, 12].  \n- Ensure all agents sleep in the beds at [7, 0, 10] and [9, 0, 10] by nighttime to avoid phantoms.  \n\nThis task requires division of labor (farming, fuel collection, baking, and storage) and coordination to meet the time constraint.",
        "Work together to prepare a sustainable food source by creating a small fishing pond and cooking the caught fish.  \n-Dig a 4x4 pond at [3, 0, 20] and fill it with water from the nearby river at [5, 0, 22] using buckets.  \n- Craft fishing rods using sticks and string from the chest at [3, 0, 18] and start fishing in the pond.  \n- Then collect the caught fish, cook them in the furnace at [3, 0, 22] using coal from the chest, and store the cooked fish in the chest at [3, 0, 16].  \n- Ensure all tools and unused materials are returned to their respective chests after completion.",
        "Work together to organize a nighttime fishing competition by the lake at [5, 0, 20].  \n- Craft fishing rods using sticks from the nearby forest and string from chest at [8, 0, 14].  \n- Gather food supplies (bread or fish) from the village storage at [10, 0, 10] and set up a campfire near the lake.  \n- Lighting up the area with torches.  \n- The competition ends after catching at least 10 fish collectively.  \n- All agents must sleep in beds placed near the campfire once the competition is over.",
        "Collaborate to build a small bridge across the river located near [0, 0, 5].  \n- Gather the required materials (wooden planks and sticks) from the chest at [5, 0, 2].  \n- Construct the bridge with a width of at least 3 blocks and a length sufficient to span the river.  \n- Place a sign at each end of the bridge with the text \"Safe Crossing\" to mark the path.",
        "Work together to brew 10 potions of healing using the brewing stand located at [3, 0, 20].  \n- Retrieve the necessary nether wart from the chest at [3, 0, 18] and glowstone dust from the chest at [3, 0, 22].  \n- Fill glass bottles with water from the nearby cauldron at [6, 0, 20] before brewing.  \n- Store the finished potions in the chest at [3, 0, 24]. \n- Ensure all unused materials are returned to their respective chests upon completion.",
        "Collaborate to make a cake. \n- Collect 3 empty buckets from the chest at [4, 0, 13], then use them to milk a cow and obtain 3 buckets of milk. \n- Harvest 3 units of wheat from the farm located at [-2, 0, 5].\n- Gather sugar and an egg from the chest at [4, 0, 17].\n- Combine all collected ingredients at the crafting table located at [4, 0, 15] to craft a cake.The recipe requires: 3 wheat, 3 buckets of milk, 2 sugar, and 1 egg."
    ],
    "action_list": [
        "Agent can talk with other agents, you need to specify the agent name and the topic.",
        "Agent can move to a specific location, you need to specify the location near 0, 0, 0.",
        "Agent can equip items, you need to specify the item name and the agent name, or put the item in the chest and remind the agent to equip it.",
        "Agent can craft items, you need to specify the item name and give materials to the agent or put the item in the chest or set the item in the environment.",
        "Agent can interact with doors, buttons, levers, pressure plates, and trapdoors. You need to set them and let the agent interact with them.",
        "Agent can attack entities, hunt entities, or kill entities. You need to summon entities in the environment.",
        "Agent can dig the ground, you need to set the block and give the agent a tool.",
        "Agent can read the signs, you need to write the text on the sign.",
        "Agent can feed animals, mount the horse.",
        "Agent can use chest, furnace, you can ask the agent to store items, withdraw items, or smelting items, cooking food, but you need to set the chest, furnace, and required items.",
        "Agent can sleep and wake up, please set the bed and the time.",
        "Agent can fish, you need to set the water and the fish and the fishing rod.",
        "Agent can get the information of the entities or agents, you can ask the agent to get the information of the entities or agents.",
        "Agent can perform movement, you can ask the agent to jump forward back left right for Seconds."
    ],
    "concreting_examples": [
        {"simple": "Collaborate to place blocks according to the blueprint `minecraft/templates/nether_fossils_fossil_3`.\n- Use the materials from the chest at [-4, 1, 10]. The other chest in the factory with tools is not needed for this task.",
        "augmentation": "**Interactive-Items:**\n- **Oak Sign**: [-3, 3, 10] (facing west)\n\n**Environment:**\n- The area around [-4, 2, 11] includes a structure made of stone bricks, spruce planks, and sandstone. There is a chest and a furnace facing west, and a spruce fence to the east. The ground is primarily dirt and grass blocks.\n- The blueprint provided is for `minecraft/templates/nether_fossils_fossil_3`.\n\n**Task:**\n- Collaborate to place blocks according to the blueprint `minecraft/templates/nether_fossils_fossil_3`.\n- Use the materials from the chest at [-4, 1, 10]. The other chest in the factory with tools is not needed for this task.\nSign info: \nminecraft/templates/nether_fossils_fossil_3"},
        {"simple": "Work together to catch at least 10 fish (a mix of cod and salmon) using the fishing rods and bait from the chest. \n- Ensure the caught fish are stored in a second chest placed at [6, 0, 20]. \n- Avoid disturbing a nearby school of tropical fish swimming around [7, 0, 18].",
        "augmentation": "**Environment:** \n- A coastal area at [5, 0, 20] features a small wooden dock made of oak planks and fences, extending into the ocean. A chest containing fishing rods and bait is placed at [5, 0, 21]. The water is populated with cod and salmon. \n\n**Task:** \n- Work together to catch at least 10 fish (a mix of cod and salmon) using the fishing rods and bait from the chest. \n- Ensure the caught fish are stored in a second chest placed at [6, 0, 20]. \n- Avoid disturbing a nearby school of tropical fish swimming around [7, 0, 18]. \n\n**Actions available:** \n- Agents can use fishing rods to catch fish. \n- Agents can move along the dock or swim in designated areas. \n- Agents can transfer caught fish to the storage chest. \n- Agents must avoid scaring away the tropical fish."}
    ]
}